
Процедура ПриЗаписи(Отказ)
	СформироватьЗаписиВРС_узИсторияХранилища(Отказ);
КонецПроцедуры

Процедура СформироватьЗаписиВРС_узИсторияХранилища(Отказ)
	ТЗДанныеДляЗаписи = ПолучитьТЗДанныеДляЗаписи();
	Для каждого СтрокаТЗДанныеДляЗаписи из ТЗДанныеДляЗаписи цикл
		МенеджерЗаписи = РегистрыСведений.узЗаписиИсторииХранилища.СоздатьМенеджерЗаписи();	
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаТЗДанныеДляЗаписи);
		МенеджерЗаписи.Записать();
	Конеццикла;
КонецПроцедуры 

Функция ПолучитьТЗДанныеДляЗаписи() 
	ТЗДанныеДляЗаписи = РегистрыСведений.узЗаписиИсторииХранилища.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для каждого СтрокаИзмененныеОбъекты из ИзмененныеОбъекты цикл
		пИдентификаторОбъектаМетаданных = СтрокаИзмененныеОбъекты.ИдентификаторОбъектаМетаданных;		
		ДобавитьВТЗДанныеДляЗаписи(пИдентификаторОбъектаМетаданных,ТЗДанныеДляЗаписи);
	Конеццикла;
	Возврат ТЗДанныеДляЗаписи;
КонецФункции 

Процедура ДобавитьВТЗДанныеДляЗаписи(ЗНАЧ ИдентификаторОбъектаМетаданныхРебенок,ТЗДанныеДляЗаписи)
	Если ТЗДанныеДляЗаписи.Найти(ИдентификаторОбъектаМетаданныхРебенок,"ИдентификаторОбъектаМетаданных") = Неопределено Тогда
		СтрокаТЗДанныеДляЗаписи = ТЗДанныеДляЗаписи.Добавить();	
		СтрокаТЗДанныеДляЗаписи.Период = ДатаВерсии;
		СтрокаТЗДанныеДляЗаписи.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданныхРебенок;
		СтрокаТЗДанныеДляЗаписи.ЗаписьИсторииХранилища = Ссылка;		
	Конецесли;
	
	РодительИдентификатораОбъектаМетаданных = ИдентификаторОбъектаМетаданныхРебенок.Родитель; 
	Если ЗначениеЗаполнено(РодительИдентификатораОбъектаМетаданных) Тогда
		ДобавитьВТЗДанныеДляЗаписи(РодительИдентификатораОбъектаМетаданных,ТЗДанныеДляЗаписи)	
	Конецесли;
КонецПроцедуры 