////////////////////////////////////////////////////////////////////////////////
// Подсистема "Валюты".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Выводит оповещение о необходимости обновления курсов валют.
//
Процедура РаботаСКурсамиВалютВывестиОповещениеОНеактуальности() Экспорт
	Если НЕ РаботаСКурсамиВалютВызовСервера.КурсыАктуальны() Тогда
		РаботаСКурсамиВалютКлиент.ОповеститьКурсыУстарели();
	КонецЕсли;
	
	ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	ПериодОбработчикаСледующегоДня = КонецДня(ТекущаяДата) - ТекущаяДата + 59;
	ПодключитьОбработчикОжидания("РаботаСКурсамиВалютВывестиОповещениеОНеактуальности", ПериодОбработчикаСледующегоДня, Истина);
КонецПроцедуры

#КонецОбласти
