
&НаКлиенте
Процедура КомандаЗагрузитьИзмененияИзХранилища(Команда)
	ВремяНачала = ТекущаяДатаНаСервере();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	Конецесли;
	Если НЕ ПолучатьИзмененияИзХранилища(Объект.Конфигурация) Тогда
		Сообщить("Ошибка! в конфигурации не настроена загрузка изменений из хранилища");
	Конецесли;
	
	РезультатФункции = ЗагрузитьИзмененияИзХранилищаНаСервере();
	ТабДокОтчет = РезультатФункции.ТабДокОтчет;
	Если ТабДокОтчет <> Неопределено Тогда
		ТабДокОтчет.Показать("Загруженная история хранилища");
	Конецесли;
	
	ВремяКонца = ТекущаяДатаНаСервере();
	Сообщить("------------------------------------------------------------------");
	Сообщить("ВремяНачала -"+ВремяНачала);
	Сообщить("ВремяКонца  -"+ВремяКонца);
	Сообщить("Общее время выполнения - "+ОКР(((ВремяКонца-ВремяНачала)/60),2) +" мин.");
	Сообщить("------------------------------------------------------------------");		
КонецПроцедуры

&НаСервере
Функция ПолучатьИзмененияИзХранилища(пКонфигурация) 
	Возврат пКонфигурация.ПолучатьИзмененияИзХранилища;
КонецФункции 

//&НаКлиенте
//Функция ВыгрузитьИзмененияНаКлиенте()
//	ИмяФайлаДляВыгрузки = ПолучитьФайлВыгрузкиИзмененийНаСервере();
//	ФайлВыгрузкиИзменений = КаталогВременныхФайлов() + ИмяФайлаДляВыгрузки;	
//	
//	НастройкиЗапускаКонфигуратора = ПолучитьНастройкиЗапускаКонфигуратораНаСервере(ФайлВыгрузкиИзменений);
//	ТекстКоманды = НастройкиЗапускаКонфигуратора.ТекстКоманды;
//	
//	//Из за того, что на сервере команда выгрузки хранилища не работает, поэтому приходится вызывать на клиенте
//	WshShell= Новый COMОбъект("WScript.Shell");
//	WshShell.Run(ТекстКоманды, 0, 1);		
//	
//	АдресФайлаПолученныйНаКлиенте = "";
//	Если НЕ ПоместитьФайл(АдресФайлаПолученныйНаКлиенте, ФайлВыгрузкиИзменений,ИмяФайлаДляВыгрузки,Ложь) Тогда
//		Сообщить("Ошибка! Не удалось поместить файл на сервер");
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	РезультатФункции = ЗагрузитьИзмененияИзХранилищаНаСервере(АдресФайлаПолученныйНаКлиенте);
//	Возврат РезультатФункции;
//КонецФункции

&НаСервере
Функция ПолучитьФайлВыгрузкиИзмененийНаСервере()
	пОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат пОбъект.ПолучитьИмяФайлаДляВыгрузки();
КонецФункции 

&НаСервере
Функция ПолучитьНастройкиЗапускаКонфигуратораНаСервере(ФайлВыгрузкиИзменений) 
	пОбъект = РеквизитФормыВЗначение("Объект"); 
	НастройкиЗапускаКонфигуратора = пОбъект.ПолучитьНастройкиЗапускаКонфигуратора(ФайлВыгрузкиИзменений);	
	
	Возврат НастройкиЗапускаКонфигуратора;
КонецФункции 

&НаСервере
Функция ЗагрузитьИзмененияИзХранилищаНаСервере()
	пОбъект = РеквизитФормыВЗначение("Объект"); 
	РезультатФункции = пОбъект.ЗагрузитьИзмененияИзХранилища();
	Возврат РезультатФункции;
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Конфигурация") Тогда
		Объект.Конфигурация = Параметры.Конфигурация;
	Конецесли;
	Объект.ВерсияС = ПолучитьПоследнююЗагруженнуюВерсиюНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююЗагруженнуюВерсиюНаСервере()
	Возврат Справочники.узИсторияКонфигураций.ПолучитьПоследнююЗагруженнуюВерсию(Объект.Конфигурация);
КонецФункции 


&НаКлиенте
Процедура КонфигурацияПриИзменении(Элемент)
	Объект.ВерсияС = ПолучитьПоследнююЗагруженнуюВерсиюНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьКомандуНаСервере()
	пОбъект = РеквизитФормыВЗначение("Объект"); 
	пОбъект.ПолучитьТекстКоманды();
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьКоманду(Команда)
	ПолучитьКомандуНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяДатаНаСервере() 
	Возврат ТекущаяДатаСеанса();
КонецФункции