///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция КлассификаторПолномочий() Экспорт
	
	Возврат РегистрыСведений.КлассификаторыМЧД.КлассификаторПолномочий();
	
КонецФункции

Функция КлассификаторОграничений() Экспорт
	
	Возврат РегистрыСведений.КлассификаторыМЧД.КлассификаторОграничений();
	
КонецФункции

Функция ЗначенияОграничений() Экспорт

	Возврат РегистрыСведений.КлассификаторыМЧД.КлассификаторЗначенийОграничений();
	
КонецФункции

Функция НастройкиПодсистемы() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("ПоказыватьСтатусВФормеСписка", Ложь);
	Настройки.Вставить("ЗаголовокКолонкиСтатуса", "");
	Настройки.Вставить("КартинкаКолонкиСтатуса", Неопределено);
	Настройки.Вставить("КоллекцияКартинокДляСтроки", Неопределено);
	
	МашиночитаемыеДоверенностиФНСПереопределяемый.ПриОпределенииНастроек(Настройки);
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти