////////////////////////////////////////////////////////////////////////////////
// Обработчики ожидания для подсистемы оценки производительности
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Процедура заканчивает замер времени выполнения ключевой операции
// Вызывается из обработчика ожидания.
Процедура ЗакончитьЗамерВремениАвто() Экспорт
	
	ОценкаПроизводительностиКлиент.ЗакончитьЗамерВремениАвтоНеГлобальный();
	
КонецПроцедуры

// Процедура вызывает функцию записи результатов замеров на сервере
// Вызывается из обработчика ожидания.
Процедура ЗаписатьРезультатыАвто() Экспорт
	
	ОценкаПроизводительностиКлиент.ЗаписатьРезультатыАвтоНеГлобальный();
	
КонецПроцедуры

#КонецОбласти
