///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если РаботаСФайламиКлиент.ДоступноСканирование() Тогда
		ПараметрыДобавленияСоСканера = РаботаСФайламиКлиент.ПараметрыДобавленияСоСканера();
		ПараметрыДобавленияСоСканера.ФормаВладелец = ЭтотОбъект;
		ПараметрыДобавленияСоСканера.ОбработчикРезультата = Новый ОписаниеОповещения("ОтсканироватьЛистЗавершение", ЭтотОбъект);
		ПараметрыДобавленияСоСканера.ТипРезультата = РаботаСФайламиКлиент.ТипРезультатаКонвертацииИмяФайла();
		ПараметрыДобавленияСоСканера.ТолькоОдинФайл = Истина; 
		РаботаСФайламиКлиент.ДобавитьСоСканера(ПараметрыДобавленияСоСканера);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтсканироватьЛистЗавершение(Результат, Контекст) Экспорт
	Если Результат <> Неопределено Тогда 
		ФайловаяСистемаКлиент.ОткрытьФайл(Результат.ИмяФайла);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти