///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаНавигационнойСсылкиВФормеУзла(Форма, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
	
 	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылка = "ФормаЗацикливаниеСинхронизации" Тогда
		
		ОткрытьФорму("РегистрСведений.КонтурСинхронизации.Форма.ЗацикливаниеСинхронизации");
		
	ИначеЕсли НавигационнаяСсылка = "ФормаОбъектыНезарегистрированныеПриЗацикливании" Тогда
		
		ПараметрыФормы = Новый Структура("УзелИнформационнойБазы", Форма.Объект.Ссылка);
		ОткрытьФорму("РегистрСведений.ОбъектыНезарегистрированныеПриЗацикливании.ФормаСписка", 
			ПараметрыФормы, Форма);
			
	ИначеЕсли НавигационнаяСсылка = "ФормаПомощникПереходаНаИнтернетВнутренняяПубликация" Тогда
		
		ПараметрыФормы = Новый Структура("УзелОбмена", Форма.Объект.Ссылка);
		ОткрытьФорму("Обработка.ПомощникСозданияОбменаДанными.Форма.ПереходНаИнтернетСоединение", 
			ПараметрыФормы, Форма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли НавигационнаяСсылка = "НеПредлагатьПерейтиНаВебСервис" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, 
			"ПереходНаВебСервис", "Видимость", Ложь);
		
		ОбменДаннымиВнутренняяПубликацияВызовСервера.ФлагНастройкиНеПредлагатьПерейтиНаВебСервис(Форма.Объект.Ссылка, Истина);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти