//{[+](фрагмент ДОБАВЛЕН), milanse 07.06.2020 0:06:10
&НаКлиенте
Перем КомпонентаБуфераОбмена;
//}milanse 07.06.2020 0:06:10

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	РезультатЗакрытия = Новый Структура();
	РезультатЗакрытия.Вставить("ФорматированныйТекст",ФорматированныйТекст);
	Закрыть(РезультатЗакрытия);	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолноэкранныйРежим(Команда)
	РезультатЗакрытия = Новый Структура();
	РезультатЗакрытия.Вставить("ФорматированныйТекст",ФорматированныйТекст);
	Закрыть(РезультатЗакрытия);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФорматированныйТекст = Параметры.ФорматированныйТекст;
	Заголовок = Параметры.ЗаголовокФормы;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//WSHShell = Новый COMОбъект("WScript.Shell");
	//WSHShell.SendKeys("%");
	//WSHShell.SendKeys("{LEFT}{LEFT}{ENTER}");
КонецПроцедуры

//{[+](фрагмент ДОБАВЛЕН), milanse 07.06.2020 0:06:35
&НаКлиенте
Процедура ВставитьКартинку(Команда)
	
	узРаботаСБуферомОбменаКлиент.НачатьПолучениеВерсииКомпоненты(Новый ОписаниеОповещения("ВставитьКартинкуПродолжение",ЭтотОбъект),КомпонентаБуфераОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьКартинкуПродолжение(Версия,ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(Версия) Тогда
		Картинка = узРаботаСБуферомОбменаКлиент.КартинкаИзБуфера("Картинка",КомпонентаБуфераОбмена);
		Если Картинка <> Неопределено Тогда
			ВыделениеНачало = Неопределено;
			ВыделениеКонец = Неопределено;
			Элементы.Содержание.ПолучитьГраницыВыделения(ВыделениеНачало,ВыделениеКонец);
			Если ВыделениеНачало <> Неопределено Тогда
				ВставитьКартинкуНаСервере(ВыделениеНачало, Картинка);
			КонецЕсли;
		Иначе
			Сообщить("Не удалось получить картинку из буфера обмена");
		КонецЕсли;
	Иначе
		Сообщить("Не удалось получить компоненту работы с буфером обмена");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВставитьКартинкуНаСервере(Знач ВыделениеНачало, Знач Картинка)
	
	Перем ТекстСсылки;
	
	ТекстСсылки = ФорматированныйТекст.Вставить(ВыделениеНачало,Картинка,Тип("КартинкаФорматированногоДокумента"));
	
КонецПроцедуры
//}milanse 07.06.2020 0:06:35
