//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

// BSLLS:ExportVariables-off
Перем ЮТДанныеКонтекста Экспорт; // Хранит данные клиентского контекста тестирования, см. ЮТКонтекстСлужебный.
Перем ЮТПараметрыПодключенияКВнешнемуСервису Экспорт; // Хранит данные для подключения к внешнему rpc серверу, 
                                                      // см. ЮТВнешнийЗапускТестовСлужебныйКлиент.ПодключитсяКСерверу
Перем ЮТТекущееСостояниеИсполненияТестов Экспорт; // Хранит текущее состояние исполнителя тестов, 
                                                  // используется для обработки/восстановления после критических ошибок.
// BSLLS:ExportVariables-on

#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
// Обработчики событий модуля
///////////////////////////////////////////////////////////////////////////////// 
#Область ОбработчикиСобытий

/////////////////////////////////////////////////////////////////////////////////
// ОТКРЫТИЕ ПРИЛОЖЕНИЯ
///////////////////////////////////////////////////////////////////////////////// 

// Используется для перехвата управления расширением после отработки запуска приложения
//@skip-check not-allowed-pragma
&После("ПриНачалеРаботыСистемы")
Процедура ЮТПриНачалеРаботыСистемы()
	
	ЮТИсполнительСлужебныйКлиент.ВыполнитьМодульноеТестирование();
	
КонецПроцедуры

&After("OnStart")
Procedure ЮТOnStart()
	
	ЮТПриНачалеРаботыСистемы();
	
EndProcedure

&После("ОбработкаОтображенияОшибки")
Процедура ЮТОбработкаОтображенияОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка)
	
	ЮТИсполнительСлужебныйКлиент.ОбработкаГлобальнойОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка);
	
КонецПроцедуры

&After("ErrorDisplayProcessing")
Процедура ЮТErrorDisplayProcessing(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка)
	
	ЮТОбработкаОтображенияОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
