
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьДоступность();
	ИсторияХранилища.Параметры.УстановитьЗначениеПараметра("ИдентификаторОбъектаМетаданных",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.ГруппаРеквизиты.ТолькоПросмотр = Истина;
	Если РазрешеноРедактировать Тогда
		Элементы.ГруппаРеквизиты.ТолькоПросмотр = Ложь;
	Конецесли;
КонецПроцедуры 

&НаКлиенте
Процедура РазрешеноРедактироватьПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры
