#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ВариантСсылка, ПараметрыВыполненияКоманды)
	ПараметрыОткрытия = ВариантСсылка;
	Форма = ПараметрыВыполненияКоманды.Источник;
	Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
		Если Форма.ИмяФормы = "Справочник.ВариантыОтчетов.Форма.ФормаСписка" Тогда
			ПараметрыОткрытия = Форма.Элементы.Список.ТекущиеДанные;
		ИначеЕсли Форма.ИмяФормы = "Справочник.ВариантыОтчетов.Форма.ФормаЭлемента" Тогда
			ПараметрыОткрытия = Форма.Объект;
		КонецЕсли;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(Форма, ПараметрыОткрытия);
КонецПроцедуры

#КонецОбласти
