&НаСервере
Функция получитьИД(пользователь)
	Возврат Пользователь.szНомерАськи;
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	
	ИДКому=ПолучитьИД(Кому);
	НастройкаАськи = Новый Структура();
	НастройкаАськи.Вставить("ИД",ИДКому);
	
	МассивПолучателейАськи=новый Массив;
	МассивПолучателейАськи.Добавить(НастройкаАськи);
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ТекстСообщения",ТекстСообщения);
	ДопПараметры.Вставить("МассивПользователейДляОтправки",МассивПолучателейАськи);
	
	рез=szАськаСервер.ВыполнитьРассылкуВАську(ДопПараметры);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРассылки()
	МассивПолучателейРассылки = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Пользователи.Ссылка КАК ПолучательСообщения
	 |ИЗ
	 |	Справочник.Пользователи КАК Пользователи
	 |ГДЕ
	 |	Пользователи.szНеПолучатьРассылкуПоАське = ЛОЖЬ
	 |	И Пользователи.szНомерАськи <> """"";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивПолучателейРассылки.Добавить(Выборка.ПолучательСообщения);
		КонецЦикла;	
	Конецесли;
	
	Возврат МассивПолучателейРассылки;
КонецФункции

&НаКлиенте
Процедура Рассылка(Команда)
	
	// Сделан тупой выбор всех пользователей у которых есть аська и разрешена рассылка
	// Подразумевается, что список рассылки вы будете формировать по своим алгоритмам
	// В список разрешено включать пользователей без аськи и с рапретом рассылки. Это условие проверится дальше
	МассивПолучателейРассылки=ПолучитьСписокРассылки();
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ТекстСообщения",ТекстРассылки);
	ДопПараметры.Вставить("МассивПользователейКому",МассивПолучателейРассылки);
	
	szАськаСервер.ВыполнитьРассылку(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьФайл(Команда)
	// Нужно указать файл доступный серверу 1С. 
	РезФайл=szАськаСервер.ОтправитьФайл(Кому,ИмяФайла);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Инструкция=ПолучитьОбщийМакет("szИнструкцияДляАськи").ПолучитьТекст();
КонецПроцедуры


&НаСервере
Процедура УстановитьНаСервере()
	// Вставить содержимое обработчика.
	Справочники.узКонстанты.szУстановитьКонстанту("ТокенБота",ТокенБота);
КонецПроцедуры


&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры

