
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Отчет = РаботаСФайламиСлужебныйВызовСервера.ИмпортФайловСформироватьОтчет(
		Параметры.МассивИменФайловСОшибками);
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтчетВыбор(Элемент, Область, СтандартнаяОбработка)
	
#Если Не ВебКлиент Тогда
	// Путь к файлу.
	Если СтрНайти(Область.Текст, ":\") > 0 ИЛИ СтрНайти(Область.Текст, ":/") > 0 Тогда
		ФайловыеФункцииСлужебныйКлиент.ОткрытьПроводникСФайлом(Область.Текст);
	КонецЕсли;
#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
