
Функция ПолучитьМассивПолучателей(МассивПользователейКому)
	
	МассивПолучателейТелеграмм = Новый Массив();
	
	Для Каждого пПользователь из МассивПользователейКому Цикл
		
		Если НЕ пПользователь.узИспользоватьРассылкуЧерезТелеграмм Тогда
			Продолжить;
		Конецесли;
		
		Если НЕ ЗначениеЗаполнено(пПользователь.узИДПользователяТелеграмм) Тогда
			Продолжить;
		Конецесли;
		
		НастройкаТелеграмм = Новый Структура();
		НастройкаТелеграмм.Вставить("ИД",пПользователь.узИДПользователяТелеграмм);
		НастройкаТелеграмм.Вставить("Пользователь",пПользователь);
		
		МассивПолучателейТелеграмм.Добавить(НастройкаТелеграмм);
		
	КонецЦикла;
	
	Возврат МассивПолучателейТелеграмм;
	
	//Вернуть = Новый Массив;
	//
	//спПользователи = Новый СписокЗначений;
	//спПользователи.ЗагрузитьЗначения(МассивПользователейКому);
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Пользователи", спПользователи);
	//Запрос.Текст = ПолучитьМассивПолучателей_ТекстЗапроса();
	//
	//тзДанные = Запрос.Выполнить().Выгрузить();
	//
	//Для Каждого стрТЗ из тзДанные Цикл
	//	
	//	Вернуть.Добавить(Новый Структура("ИД, Пользователь", стрТЗ.ИД, стрТЗ.Пользователь));
	//	
	//КонецЦикла;
	//
	//Возврат Вернуть;
	
КонецФункции

Функция Удалить_ПолучитьМассивПолучателей_ТекстЗапроса() 
	//Возврат "
	//|ВЫБРАТЬ
	//|	ПользователиДополнительныеРеквизиты.Ссылка КАК Пользователь,
	//|	ПользователиДополнительныеРеквизиты.Значение,
	//|	ПользователиДополнительныеРеквизиты.Свойство.Заголовок КАК Свойство
	//|ПОМЕСТИТЬ ВТ_Все
	//|ИЗ
	//|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	//|ГДЕ
	//|	ПользователиДополнительныеРеквизиты.Ссылка В(&Пользователи)
	//|	И (ПользователиДополнительныеРеквизиты.Свойство.Заголовок = ""Телеграмм_ИД""
	//|			ИЛИ ПользователиДополнительныеРеквизиты.Свойство.Заголовок = ""Телеграмм_Отключить"")
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Все.Пользователь,
	//|	ВТ_Все.Значение КАК ИД,
	//|	NULL КАК Отключить
	//|ПОМЕСТИТЬ ВТ_Раздельно
	//|ИЗ
	//|	ВТ_Все КАК ВТ_Все
	//|ГДЕ
	//|	ВТ_Все.Свойство = ""Телеграмм_ИД""
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_Все.Пользователь,
	//|	NULL,
	//|	ВТ_Все.Значение
	//|ИЗ
	//|	ВТ_Все КАК ВТ_Все
	//|ГДЕ
	//|	ВТ_Все.Свойство = ""Телеграмм_Отключить""
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Раздельно.Пользователь,
	//|	МАКСИМУМ(ВТ_Раздельно.ИД) КАК ИД,
	//|	МАКСИМУМ(ВТ_Раздельно.Отключить) КАК Отключить
	//|ПОМЕСТИТЬ ВТ_Групп
	//|ИЗ
	//|	ВТ_Раздельно КАК ВТ_Раздельно
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Раздельно.Пользователь
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Все.Пользователь,
	//|	ЕСТЬNULL(ВТ_Групп.ИД, """") КАК ИД,
	//|	ЕСТЬNULL(ВТ_Групп.Отключить, ЛОЖЬ) КАК Отключить
	//|ПОМЕСТИТЬ ВТ_Данные
	//|ИЗ
	//|	ВТ_Все КАК ВТ_Все
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Групп КАК ВТ_Групп
	//|		ПО ВТ_Все.Пользователь = ВТ_Групп.Пользователь
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Данные.Пользователь,
	//|	ВТ_Данные.ИД,
	//|	ВТ_Данные.Отключить
	//|ИЗ
	//|	ВТ_Данные КАК ВТ_Данные
	//|ГДЕ
	//|	НЕ ВТ_Данные.ИД = """"
	//|	И ВТ_Данные.Отключить = ЛОЖЬ	
	//|";
КонецФункции 

Процедура ВыполнитьРассылку(ДопПараметры) Экспорт

	ТокенБота = Константы.узТелеграмм_ТокенБота.Получить();
	Если Не ЗначениеЗаполнено(ТокенБота) Тогда
		Возврат;
	КонецЕсли;
	
	масПолучатели = ПолучитьМассивПолучателей(ДопПараметры.МассивПользователейКому);
	
	Если масПолучатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПисьма = СтрЗаменить(ДопПараметры.ТекстПисьма, "#", "");
	ТемаПисьма	= ДопПараметры.ТемаПисьма;
	
	Для Каждого элемПолучатель Из масПолучатели Цикл
		
		Ресурс 		= "bot" + ТокенБота + "/sendMessage?chat_id=" + Формат(элемПолучатель.ИД, "ЧГ=") + "&text=" + ТекстПисьма+"&parse_mode=Markdown&disable_web_page_preview=true";
		//Ресурс 		= "bot" + ТокенБота + "/sendMessage?chat_id=" + Формат(элемПолучатель.ИД, "ЧГ=") + "&text=" + ТекстПисьма+"&disable_web_page_preview=true";
		Соединение  = Новый HTTPСоединение("api.telegram.org", 443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		ЗапросHTTP 	= Новый HTTPЗапрос(Ресурс);
		Ответ 		= Соединение.Получить(ЗапросHTTP);
		
		Если Не Ответ.КодСостояния = 200 Тогда
			ЗаписьЖурналаРегистрации("Телеграмм.Отправка", УровеньЖурналаРегистрации.Ошибка,,
				, "Не смогли отправить пользователю <"+элемПолучатель.ИД+":"+элемПолучатель.Пользователь+">");
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры




