//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// ЗначениеКонтекста
//  Возвращает значение вложенного контекста, вложенного реквизита контекста
// Параметры:
//  ИмяРеквизита - Строка - Имя реквизита/вложенного контекста
// Возвращаемое значение:
//  - Структура - Значение реквизита/вложенного контекста
// 	- Неопределено
Функция ЗначениеКонтекста(ИмяРеквизита) Экспорт
	
	Возврат ЮТКонтекстСлужебный.ЗначениеКонтекста(ИмяРеквизита);
	
КонецФункции

// УстановитьЗначениеКонтекста
// Устанавливает значение вложенного контекста, вложенного реквизита контекста
// 
// Параметры:
//  ИмяРеквизита - Строка - Имя реквизита/вложенного контекста
//  Значение - Произвольный - Новое значение реквизита/вложенного контекста
Процедура УстановитьЗначениеКонтекста(ИмяРеквизита, Значение) Экспорт
	
	ЮТКонтекстСлужебный.УстановитьЗначениеКонтекста(ИмяРеквизита, Значение);
	
КонецПроцедуры

// Параметры движка.
// 
// Возвращаемое значение:
//  см. ЮТФабрика.ОпцииДвижка
Функция ОпцииДвижка() Экспорт
	
	Возврат ЮТКонтекстСлужебный.ОпцииДвижка();
	
КонецФункции

#КонецОбласти
