////////////////////////////////////////////////////////////////////////////////
// Подсистема "Анкетирование"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Создает структуру отбора, для дальнейшей передачи на сервер,
// и использования в качестве параметров отбора динамических списков вызываемых форм.
//
Функция СоздатьСтруктуруПараметраОтбора(ТипОтбора,ЛевоеЗначение,ВидСравнения,ПравоеЗначение) Экспорт

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТипОтбора",ТипОтбора);
	СтруктураВозврата.Вставить("ЛевоеЗначение",ЛевоеЗначение);
	СтруктураВозврата.Вставить("ВидСравнения",ВидСравнения);
	СтруктураВозврата.Вставить("ПравоеЗначение",ПравоеЗначение);
	
	Возврат СтруктураВозврата;

КонецФункции

#КонецОбласти
