
&НаСервере
Функция ВернутьТекущегоПользователя()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

&НаКлиенте
Процедура Аська_szОтправитьВАськуПосле(Команда)
	Форма=ПолучитьФорму("Обработка.szОтправитьСообщениеВАську.Форма.Форма");
	Форма.Объект.ТекстСообщения="Сообщение от " + ВернутьТекущегоПользователя() + " из Задачи №" + Объект.Код + ": " + Объект.Наименование;
	Форма.Объект.Кому=Объект.Исполнитель;
	
	Форма.Открыть();
КонецПроцедуры

&НаСервере
&После("УстановитьВидимостьДоступность")
Процедура Аська_УстановитьВидимостьДоступность()
	
	Элементы.szОтправитьВАську.Видимость=Ложь;
	Если НЕ ПустаяСтрока(Объект.Исполнитель.szНомерАськи) Тогда 
		Элементы.szОтправитьВАську.Видимость=Истина;
	КонецЕсли;
		
КонецПроцедуры
