
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// вызов сервера
	ИмяПланаОбмена = ИмяПланаОбмена(ПараметрКоманды);
	
	// вызов сервера
	ВидПравил = ПредопределенноеЗначение("Перечисление.ВидыПравилДляОбменаДанными.ПравилаРегистрацииОбъектов");
	
	Отбор              = Новый Структура("ИмяПланаОбмена, ВидПравил", ИмяПланаОбмена, ВидПравил);
	ЗначенияЗаполнения = Новый Структура("ИмяПланаОбмена, ВидПравил", ИмяПланаОбмена, ВидПравил);
	
	ОбменДаннымиКлиент.ОткрытьФормуЗаписиРегистраСведенийПоОтбору(Отбор, ЗначенияЗаполнения, "ПравилаДляОбменаДанными", ПараметрыВыполненияКоманды.Источник, "ПравилаРегистрацииОбъектов");
	
КонецПроцедуры

&НаСервере
Функция ИмяПланаОбмена(Знач УзелИнформационнойБазы)
	
	Возврат ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(УзелИнформационнойБазы);
	
КонецФункции

#КонецОбласти
