 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МеткиЗадачи = Параметры.МеткиЗадачи;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	узМеткиЗадач.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.узМеткиЗадач КАК узМеткиЗадач
	|ГДЕ
	|	НЕ узМеткиЗадач.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	узМеткиЗадач.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		МеткаСсылка = Выборка.Ссылка;
		
		СтрокаМетки = Метки.Добавить();	
		СтрокаМетки.ЦветМетки = МеткаСсылка.ЦветМетки.Получить(); 
		СтрокаМетки.Метка = МеткаСсылка;     

		СтрокаМетки.Пометка = Ложь;			
		Если МеткиЗадачи.Найти(МеткаСсылка) <> Неопределено Тогда
			СтрокаМетки.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
