&НаКлиенте
Перем МодификацияПараметровКалендаря;

&НаКлиенте
Процедура ЦветаПоУмолчанию(Команда)
	ОсновнойЦветФонаЗадач 				= Новый Цвет(255, 255, 255);
	ОсновнойЦветТекстаЗадач 			= Новый Цвет(0, 0, 0);
	ОсновнойЦветФонаСуммирующихЗадач 	= Новый Цвет(255, 251, 240);
	ОсновнойЦветТекстаСуммирующихЗадач	= Новый Цвет(0, 0, 0);
	ЦветФонаЗавершенныхЗадач 			= Новый Цвет(240, 240, 240);
	ЦветТекстаЗавершенныхЗадач 	 		= Новый Цвет(0, 0, 0);
	ЦветФонаВыполняющихсяЗадач 			= Новый Цвет(211, 255, 226);
	ЦветТекстаВыполняющихсяЗадач 		= Новый Цвет(0, 0, 0);// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	Закрыть(?(МодификацияПараметровКалендаря = Истина, 2, 1));
КонецПроцедуры

&НаКлиенте
Процедура СубботаРабочийПриИзменении(Элемент)
	МодификацияПараметровКалендаря = Истина;
КонецПроцедуры

