////////////////////////////////////////////////////////////////////////////////
// Клиентские события рассылок отчетов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик активизации строки пользовательской настройки СКД отчета.
//
// Параметры:
//   Отчет - ДанныеФормыЭлементКоллекции - Строка табличной части, описывающая отчет.
//       Свойства для чтения:
//         * ПолноеИмя - Строка - Полное имя отчета. Например: "Отчет.ИмяОтчета".
//         * КлючВарианта - Строка - Ключ варианта отчета.
//         * Отчет - СправочникСсылка.ВариантыОтчетов - Ссылка варианта отчета.
//         * Представление - Строка - Наименование варианта отчета.
//       Свойства для изменения:
//         * ВнесеныИзменения - Булево - Следует установить Истина когда меняются пользовательские настройки отчета.
//   КомпоновщикНастроекКД - КомпоновщикНастроекКомпоновкиДанных - Все настройки отчета.
//       Свойства для изменения:
//       * ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - Все пользовательские настройки отчета.
//       Все прочие свойства - только для чтения.
//   ИдентификаторКД - ИдентификаторКомпоновкиДанных - Идентификатор пользовательской настройки отчета.
//       Может использоваться для получения данных пользовательской настройки. Например:
//       	ПользовательскаяНастройкаКД = КомпоновщикНастроекКД.НайтиПоИдентификатору(ИдентификаторКД);
//   ТолькоПросмотрЗначения - Булево - Флажок возможности непосредственного редактирования колонки "Значение".
//       Если установить в Истина, то следует определить обработчик выбора значения в событии "ПриНачалеВыбораНастройки".
//
Процедура ПриАктивизацииСтрокиНастройки(Отчет, КомпоновщикНастроекКД, ИдентификаторКД, ТолькоПросмотрЗначения) Экспорт
	
КонецПроцедуры

// Обработчик начала выбора значения для строки пользовательской настройки СКД отчета.
//
// Параметры:
//   Отчет - ДанныеФормыЭлементКоллекции - Строка табличной части, описывающая отчет.
//       Свойства для чтения:
//         * ПолноеИмя - Строка - Полное имя отчета. Например: "Отчет.ИмяОтчета".
//         * КлючВарианта - Строка - Ключ варианта отчета.
//         * Отчет - СправочникСсылка.ВариантыОтчетов - Ссылка варианта отчета.
//         * Представление - Строка - Наименование варианта отчета.
//       Свойства для изменения:
//         * ВнесеныИзменения - Булево - Следует установить Истина когда меняются пользовательские настройки отчета.
//   КомпоновщикНастроекКД - КомпоновщикНастроекКомпоновкиДанных - Все настройки отчета.
//       Свойства для изменения:
//       * ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - Все пользовательские настройки отчета.
//       Все прочие свойства - только для чтения.
//   ИдентификаторКД - ИдентификаторКомпоновкиДанных - Идентификатор пользовательской настройки отчета.
//       Может использоваться для получения данных пользовательской настройки. Например:
//       	ПользовательскаяНастройкаКД = КомпоновщикНастроекКД.НайтиПоИдентификатору(ИдентификаторКД);
//   СтандартнаяОбработка - Булево - Если Истина, то будет использован стандартный диалог выбора.
//       Если используется собственная обработка события, то следует установить в Ложь.
//   ОбработчикРезультата - Обработчик результата выбора прикладной формы.
//       В качестве результата в ОбработчикРезультата могут быть переданы значения типов:
//       Неопределено - Пользователь отказался от выбора.
//       ПользовательскиеНастройкиКомпоновкиДанных - Новые настройки отчета.
//
Процедура ПриНачалеВыбораНастройки(Отчет, КомпоновщикНастроекКД, ИдентификаторКД, СтандартнаяОбработка, Обработчик) Экспорт
	
КонецПроцедуры

// Обработчик очистки значения для строки пользовательской настройки СКД отчета.
//
// Параметры:
//   Отчет - ДанныеФормыЭлементКоллекции - Строка табличной части, описывающая отчет.
//       Свойства для чтения:
//         * ПолноеИмя - Строка - Полное имя отчета. Например: "Отчет.ИмяОтчета".
//         * КлючВарианта - Строка - Ключ варианта отчета.
//         * Отчет - СправочникСсылка.ВариантыОтчетов - Ссылка варианта отчета.
//         * Представление - Строка - Наименование варианта отчета.
//       Свойства для изменения:
//         * ВнесеныИзменения - Булево - Следует установить Истина когда меняются пользовательские настройки отчета.
//   КомпоновщикНастроекКД - КомпоновщикНастроекКомпоновкиДанных - Все настройки отчета.
//       Свойства для изменения:
//       * ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - Все пользовательские настройки отчета.
//       Все прочие свойства - только для чтения.
//   ИдентификаторКД - ИдентификаторКомпоновкиДанных - Идентификатор пользовательской настройки отчета.
//       Может использоваться для получения данных пользовательской настройки. Например:
//       	ПользовательскаяНастройкаКД = КомпоновщикНастроекКД.НайтиПоИдентификатору(ИдентификаторКД);
//   СтандартнаяОбработка - Булево - Если Истина, то значение настройки будет очищено.
//       Если значение настройки не должно быть очищено, то следует установить в Ложь.
//
Процедура ПриОчисткеНастройки(Отчет, КомпоновщикНастроекКД, ИдентификаторКД, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти
