//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЮТОпросВебСокетСоединения() Экспорт
	
	ЮТВнешнийЗапускТестовСлужебныйКлиент.ОпросСообщенийВебСокетВК();
	
КонецПроцедуры

Процедура ЮТОтложенныйЗапускОбработчикаИсполненияТестов() Экспорт
	
	ТекущееСостояние = ЮТСостояниеИсполненияТестовСлужебный.ТекущееСостояние();
	Обработчик = ТекущееСостояние.Обработчик;
	ЮТАсинхроннаяОбработкаСлужебныйКлиент.ВызватьОбработчик(Обработчик, ТекущееСостояние.Результат);
	
КонецПроцедуры

Процедура ЮТОтложенныйЗапускСледующегоОбработчикаИсполненияТестов() Экспорт
	
	ТекущееСостояние = ЮТСостояниеИсполненияТестовСлужебный.ТекущееСостояние();
	ЮТАсинхроннаяОбработкаСлужебныйКлиент.ВызватьСледующийОбработчик(ТекущееСостояние.ПараметрыИсполнения);
	
КонецПроцедуры

Процедура ЮТВосстановлениеРаботыПослеГлобальнойОшибки() Экспорт
	
	ТекущееСостояние = ЮТСостояниеИсполненияТестовСлужебный.ТекущееСостояние();
	Если ТекущееСостояние = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = ТекущееСостояние.Обработчик;
	
	ЮТАсинхроннаяОбработкаСлужебныйКлиент.ВызватьОбработчик(Обработчик, ТекущееСостояние.Результат, Истина);
	
КонецПроцедуры

#КонецОбласти
